app/controllers/account_controller.rb

  def openid
    if data = RPXNow.user_data(params[:token])
      data = {:user_name => data[:username], :email => data[:email], :identifier => data[:identifier]}
      self.current_user = UserProfile.find_by_identifier(data[:identifier]) || UserProfile.create!(data)
---
INSERT INTO `user_profiles` (`created_at`, `updated_at`, `user_name`, `last_name`, `identifier`, `email`, `first_name`) VALUES('2010-06-18 16:00:18', '2010-06-18 16:00:18', 'claus.herther', NULL, 'https://www.google.com/accounts/o8/id?id=AItOawlD8A4ywnBF1yvS7Bb9oglLr8p0HJzwlRY', 'claus.herther@gmail.com', NULL)
SELECT * FROM `user_profiles` WHERE (`user_profiles`.`identifier` = 'https://www.google.com/accounts/o8/id?id=AItOawlD8A4ywnBF1yvS7Bb9oglLr8p0HJzwlRY') LIMIT 1