app/controllers/workouts_controller.rb

  def all
    totals = Workout.find(:first, :select => 'sum(workout_length) as total_mins, count(*) as total_count')
    @total_mins = totals.total_mins
    @total_count = totals.total_count
    if params[:id] != nil
      id = params[:id]
      @workout = Workout.find(id, :include => [:user_profile,:workout_type])
---
SELECT * FROM `workouts` WHERE (`workouts`.`id` = '1') LIMIT 1
SELECT * FROM `user_profiles` WHERE (`user_profiles`.`id` IN (1,2))
SELECT * FROM `workout_types` WHERE (`workout_types`.`id` IN (1,2,4))

  def my
    if self.current_user == nil
      redirect_to "/account/login"
    end
    condition = ['user_profile_id = :user_profile_id', { :user_profile_id => self.current_user.id }]
    id = params[:id] != nil ? params[:id] : Workout.find(:first, :select => 'max(id) as last_id', :conditions => condition).last_id
    @workout = Workout.find_by_id(id, condition)

    totals = Workout.find(:first, :select => 'sum(workout_length) as total_mins, count(*) as total_count', :conditions => condition)
    @total_mins = totals.total_mins
    @total_count = totals.total_count

    @workouts = Workout.find(
      :all,
      :conditions => condition,
      :include => [:user_profile,:workout_type],
      :limit => 50,
      :order => 'workout_date desc, created_at desc')
---
SELECT * FROM `workouts` WHERE (user_profile_id = 1) ORDER BY workout_date desc, created_at desc LIMIT 50
SELECT sum(workout_length) as total_mins, count(*) as total_count FROM `workouts` WHERE (user_profile_id = 1) LIMIT 1
SELECT * FROM `user_profiles` WHERE (`user_profiles`.`id` = 1) LIMIT 1
SELECT * FROM `workout_types` WHERE (`workout_types`.`id` IN (1,2,4))

  def top
    totals = Workout.find(:first, :select => 'sum(workout_length) as total_mins, count(*) as total_count')
    @total_mins = totals.total_mins
    @total_count = totals.total_count
    @users = Workout.find(:all,
      :select => 'user_profile_id, SUM(workout_length) as workout_length, COUNT(*) as number_workouts',
      :group => 'user_profile_id',
      :include => :user_profile,#,:workout_type],
      :order => 'number_workouts desc, workout_length desc',
      :limit => 10)
---
SELECT * FROM `user_profiles` WHERE (`user_profiles`.`id` = 1)

  def save
    @workout = Workout.new(params[:workout])
    #@workout.user_profile_id = self.current_user.id
    if @workout.save
---
INSERT INTO `workouts` (`created_at`, `updated_at`, `workout_type_id`, `user_profile_id`, `workout_date`, `workout_length`) VALUES('2010-06-18 16:01:41', '2010-06-18 16:01:41', 1, 1, '2010-06-18', 45)